package ru.nuclearreactor.forceofworlds.pages.Mixins.foods

val arrayOfFoodsOptions: Array<Food> = arrayOf(
    Food(
        "Двойная порция мороженого",
        "порция трёх цветного мороженного с кусочками какого-то фиолетового желе. Под изящно крутящейся тарелкой, меняя тональность, зажглись цветовые сверкающие огоньки к этой фиерии добавился искусственный дым. Забавно, подобный вид зрелища вернул мне воспоминания и ощущение детства и безмятежности из прошлой жизни, но лишь на мгномене. Я вспомнил ужас войны, который заставил меня и многих всё потерять. Великий проект рухнул из-за амбиций банды интриганов, превращая в пепел мечты о рае. Потерянный на веке, пылившийся теперь под грудой радиоактивных обломков, стираемый песчаными бурями и кислотными дождями проникающими под разрушенные купола. Я на миг отбросил гнев и, с сожалением, взял тарелку, выбирая место где можно разместиться"
    ),
    Food(
        "Изогречка с морепродуктами",
        "порция гречневой каши с синтетическим рыбным белком в виде фигурок морских обитателей. На галоизображении появился рекламный ролик компании, так и неубранный техниками в связи с падением экономической модели Эдема, в котором могучий бог древности с трезубцем борется с громадным кальмаром. Ролик заканчивался словами \"ты выбрал лучший завтрак победителя\" и логотипом компании.\n" +
                "Слышал, что в древности существовали мифы о крае плоской земли и чудовищах, обитаемых на отшибе мира, которые в одиночку могли пожрать целый корабль. Однако эти мифы были развеяны очень давно, наряду с теми, что корабль ходит только исключительно по морю. В первой версии страны советов Сергей Павлович Королёв, перехватив знамя инициативы Циолковского перевернул мир с ног на голову. Теперь корабль мог ходить по далекому небу, за облаками на которых располагались боги, а сама Земля стала лишь материком, от которой пошли космические маршруты по всей солнечной системе. Доказательств существования ни богов ни чудовищ обнаружено не было, однако и не могло опровергнуть ведь мы к этому времени обследовали не более 0,1% вселенной и даже в нашем далёком от первых космических походов мире существовали явления, которые учёные с трудом могли описать. Я отвлёкся от своих мыслей, оглядел столовую."
    ),
    Food(
        "Порция бифштекса",
        "порция бифштекса с горошком и зеленью. При создании искуственного мяса аппарат использует наборы аминокислот, которые под действием сложных и мгновенных процессов формируются в пищевой белок по заданным параметрам, затем распечатывает в виде волокон для придания текстурности. С овощами и зеленью проще"
    )
)